In [2]:
import pandas as pd

In [3]:
dataframe = pd.read_csv('recursos/dataframeutf8.csv')

## Dataframes

Un DataFrame es una serie de Series Pandas indexadas por un valor

`Nota: Para trabajar con caracteres especiales del idioma Español, guardar los archivos con encodign utf-8. Se puede usar el notepad o cualquier editor de texto.`

In [4]:
dataframe

  Nombre y apellido  Edad       País Automovil
0              Juan    35     Mexico        No
1             Pedro    41   Honduras        Si
2             Maria    28       Peru        Si
3             Laura    66  Argentina        No

## Series

Un objeto "Series" es un vector con datos indexados

In [5]:
dataframe['Nombre y apellido']

0     Juan
1    Pedro
2    Maria
3    Laura
Name: Nombre y apellido, dtype: object

In [6]:
dataframe.País

0       Mexico
1     Honduras
2         Peru
3    Argentina
Name: País, dtype: object

In [9]:
dataframe[['Edad','Automovil']]

   Edad Automovil
0    35        No
1    41        Si
2    28        Si
3    66        No

### Conocer el tipo de dato

Nota como para la Serie Edad, nos muestra

`pandas.core.series.Series`

Y para las series Edad y Automovil

`pandas.core.frame.DataFrame`

In [10]:
type(dataframe.Edad)

pandas.core.series.Series

In [11]:
type(dataframe[['Edad','Automovil']])

pandas.core.frame.DataFrame